### seq2seq를 이용하는 애플리케이션 ###

# 실제 사용 예시들
# 1. 기계 번역 : '한 언어의 문장'을 '다른 언어의 문장'으로 변환
# 2. 자동 요약 : '긴 문장'을 '짧게 요약된 문장'으로 변환
# 3. 질의 응답 : '질문'을 '응답'으로 변환
# 4. 메일 자동 응답 : '받은 메일의 문장'을 '답변 글'로 변환

# seq2seq는 2개가 짝을 이루는 시계열 데이터르 다루는 문제에 이용할 수 있다.

### 챗봇
# 사람과 컴퓨터가 텍스트로 대화를 나누는 프로그램
# 대화는 '상대의 말'과 '자신의 말'로 구성되기 때문에 '상대방의 말'을 '자신의 말'로 변환하는 문제로 볼 수 있다.
# 대화의 텍스트 데이터가 준비되면 seq2seq를 학습시킬 수 있다.

### 이미지 캡셔닝
# 이미지를 문장으로 변환하는 기술
# seq2seq의 Encoder 부분을 CNN으로 변경하고 Decoder와 연결하여 이미지 캡셔닝을 구현할 수 있다.
# 이를 위해선 이미지와 해당 이미지의 설명을 듬뿍 담은 학습 데이터가 필요하다.

# ***
# 문장을 생성할 때는 하나의 단어를 주고 모델의 출력(확률 분포)에서 샘플링하는 과정을 반복한다.