### RNN이란 ###

# RNN, Recurrent Neural Network로 순환하는 신경망을 뜻한다.

### 순환하는 신경망
# 순환 : 어느 한 지점에서 시작한 것이 시간을 지나 다시 원래 장소로 돌아오는 것.
# 순환하기 위해서 '닫힌 경로(순환하는 경로)'가 필요하다!
# 데이터가 '닫힌 경로'(순환하는 경로)를 통해 같은 장소를 반복해 왕래하며 정보가 끊임없이 갱신된다.

# 비유
# 몸에 흐르는 혈액은 어제부터 계속해서 흐르던 혈액이다. 생명을 얻은 순간부터 계속 흐르기 시작했고 과거로부터 현재로 끊임없이 '갱신'된다.

# RNN의 특징은 '순환하는 경로'에 있으며 이 경로를 따라 데이터가 끊임없이 순환할 수 있다. 
# 데이터가 순환하기 때문에 과거의 정보를 기억하는 동시, 최신 데이터로 갱신될 수 있다!

# RNN 계층은 입력으로 x.t를 입력 받고 h.t를 출력하는데 여기서 t는 시각을 뜻한다.(시계열 데이터를 나타내기 위함, 문장의 순서 w1다음w2다음w3)
# 각 시각에 입력되는 x.t는 벡터라고 가정한다. 문장을 다루는 경우를 예로 들면 각 단어의 분산 표현이 x.t가 된다.


### 순환 구조 펼치기