### 어텐션의 구조 ###

# seq2seq를 한층 더 강력하게 해줌
# 어텐션 덕분에 seq2seq는 필요한 정보에만 '주목'할 수 있게 된다.

### seq2seq의 문제점
# Encoder가 시계열 데이터를 인코딩, Encoder의 출력은 '고정 길이 벡터'이다.
# 입력 문장이 아무리 길어도 길이가 고정되어 있기 때문에 한계가 존재한다.(문장의 길이가 길어지면 필요한 정보가 벡터에 모두 담기지 못한다)

### Encoder 개선
# Encoder의 출력 길이는 입력 문장의 길이에 따라 변하는 것이 좋다.
# => Enocder의 LSTM 계층의 모든 은닉 상태 벡터를 모두 이용!
# 각 시각의 은닉 상태 벡터를 모두 이용하면 입력된 단어와 동일한 차원(크기의) 행렬(은닉층의 set)을 얻을 수 있다.
# ex) 단어 5개가 입력 => 은닉층 5개 => Encoder는 5개의 은닉층을 행렬의 형태로 출력 (고정 길이에서 해방)

# Encoder의 각 LSTM 계층의 은닉 상태는 해당 계층의 input 단어의 영향을 가장 많이 받게 된다. 
# 따라서 Encoder가 출력하는 hs 행렬은 각 단어에 해당하는 벡터들의 집한이라고도 볼 수 있다.


### Decoder 개선(1)

