### 시소러스 ###

# '단어의 의미'를 나타내는 방법
# 단어의 의미를 나타내는 가장 단순한 방법은 사람이 단언의 의미를 정의하는 것이다.
# 시소러스 : 유의어 사전, 뜻이 같은 단어(동의어), 뜻이 비슷한 단어(유의어)가 한 그룹으로 분류되어 있다.
# ex) car = auto, automobile, machine, motorcar
# 시소러스에는 상위와 하위, 전체와 부분 등으로 세세한 관계까지 정의해둔 경우가 있다.
# 이처럼 모든 단어에 대한 유의어 집합을 만든 후, 단어들의 관계를 그래프로 표현하면 단어사이의 연결을 정의할 수 있다.
# 이 단어 네트워크르 이용하여 컴퓨터에게 단어를 가르칠 수 있고 단어의 의미를 간접적으로라도 이해시켰다고 주장은 할 수 있다.

### WordNet
# 자연어 처리 분야에서 가장 유명한 시소러스

### 시소러스 문제점
# 시대 변화에 대응하기 힘듦 : 시대에 따라 새로운 단어가 생겨나거나 단어의 의미가 변하기도 한다.
# 사람을 쓰는 비용이 막대함
# 단어의 미묘한 차이를 표현하기 힘들다 : 비슷한 단어라도 미묘한 차이가 있기 마련인데 그것을 시소러스만으로 표현하기는 어렵다.
# 이 문제를 해결하기 위해 '통계 기반 기법','추론 기반 기법(신경망)'을 사용한다. => 대량의 텍스트에서 단어의 의미를 자동으로 추출


