### word2vec 남은 주제 ###

### word2vec을 사용한 애플리케이션의 예
# word2vec으로 얻은 단어의 분산 표현은 비슷한 단어를 찾는 용도로 사용할 수 있다.
# 자연어 문제를 풀 때 단어 분산 표현을 처음 부터 학습하는 경우는 없다.
# 데이터가 큰 말뭉치로 단어분산 학습을 끝낸 후 그 결과(분산표현)을 각자의 작업에 맞게 이용하는 것.(전이학습)
# cf) 전이학습 : 한 분야에서 배운 지식을 다른 분야에도 적용하는 기법.
# 단어의 분산 표현은 단어를 고정 길이 벡터로 변환해주는 이점을 가지고 있다.(문장 또한 고정 길이 벡터로 변환할 수 있다!)
# 문장을 고정 길이 벡터로 변환하는 연구가 활발히 진행 중
# bag-of-words : 문장의 각 단어를 분산표현으로 변환하고 그 합을 구하는 방법
# 단어나 문장을 고정 길이 벡터로 변환하는 task는 매우 중요한데, 벡터로 변환할 수 있게 되면 머신러닝 기법(신경망 or SVM)에 적용할 수 있기 때문이다.

# 일반적으로 다음과 같은 순서로 진행된다.
# 질문(자연어) => 단어 벡터화(word2vec) => 머신러닝 시스템(신경망,SVM 등) => 답변
# 단어나 문장을 벡터로 변환한다면 위와 같이 머신러닝 시스템의 입력으로 단어나 문장을 사용할 수 있다. 
# => 머신러닝 시스템 틀 안에서 원하는 답을 출력하는 것이 가능해진다!
# '단어 벡터화'단계와 '머신러닝 시스템' 단계는 서로 다른 데이터를 가지고 학습하는 것이 일반적이다.
# '단어 벡터화'단계에서는 위키백과와 같은 범용 말뭉치를 사용해 미리 학습 해둔다.
# '머신러닝 시스템'은 현재 직면한 문제에 관련하여 수집한 데이터를 가지고 학습시킨다.

# 사용예시
# 사용자가 보낸 메일을 자동으로 분류하는 시스템. 분류는 감정을 3단계로 분류(긍정적,중립적,부정적)
# 1. 데이터를 수집하고 수집한 데이터을 레이블화 한다. (긍정적 반응을 보낸 메일은 긍정적....)
# 2. 사전에 학습된 word2vec을 사용하여 메일을 벡터로 변환한다.
# 3. 감정 분석을 수행하는 어떤 분류 시스템이나(SVM or 신경망)에 벡터화된 메일과 감정 레이블을 입력하여 학습을 수행한다.
# 즉 단어나 문장을 벡터로 표현할 수 있기에 이를 일반적인 머신러닝 기법으로 해결할 수 있게 된 것이다!

### 단어 벡터 평가 방법
# 단어 분산 표현의 우수성을 실제 애플리케이션과 분리해 평가하는 것이 일반적이다.

# 단어의 유사성 평가
# 사람이 단어 사이의 유사한 정도를 규정 
# ex) (cat,animal) = 8, (cat,car) = 2
# 위 단어 쌍들에 대한 word2vec에 의한 코사인 유사도 점수를 비교!

# 유추 문제를 활영한 평가
# king : queen = man : ? 과 같은 유추문제를 출제하고 그 정답률로 단어 분산 표현의 우수성을 측정

# 단어의 분산 표현의 우수함이 애플리케이션에 얼마나 기여하는지는 애플리케이션 종류나 말뭉치의 내용 등 문제와 상황에 따라 다르다.
# 즉, 유추 문제에 의한 평가가 높다고 해서(분산 표현의 우수성) 애플리케이션에서도 반드시 좋은 결과가 나오리라는 보장은 없다!

### 정리
# word2vec의 CBOW를 개선하는 포인트는 '모두' 대신 '일부'를 처리하는 것이다.(컴퓨터가 모든 데이터를 처리하는 것은 비현실적)
# 꼭 필요한 일부에 집중하는 편이 얻는 것이 많다.(Embedding,네거티브 샘플링)